#include <iostream>
#include <vector>
#include <locale>
#include <algorithm>
using namespace std;

int main()
{
	setlocale(LC_ALL, "en_US.UTF-8");

	int n; cin >> n;
	vector<int> nums(n);
	for (int i = 0; i < n; i++)
		cin >> nums[i];

	sort(nums.begin(), nums.end());

	int m; cin >> m;
	int a, b;
	int counter = 0;

	for (int i = 0; i < m; i++)
	{
		cin >> a >> b;
		auto it = upper_bound(nums.begin(), nums.end(), b);
		auto low = lower_bound(nums.begin(), nums.end(), a);

		cout << it - low << endl;
	}

}

//Дадена е редица, съставена от n елемента, които са цели положителни числа.
//
//Напишете програма range, която за всяка заявка, съставена от две цели положителни числа a и b, a ≤ b, намира броя на елементите в дадената редица, чиято стойност е между a и b(включително a и b).
//
//Input Format
//
//На първия ред е записан броя n на елементите в дадената редица.На втория ред са записани елементите на редицата.Следва ред, съдържащ броя на заявките - m.Следват m реда, всеки съдържащ по една заявка.Всяка заявка се състои от стойностите на съответните двойки числа а и b.За всяка заявка е дадено, че a ≤ b.
//
//Constraints
//
//0 < n < 100 000; 0 < m < 100 000; стойностите на числата в дадената редица и в заявките не са по - големи от 100 000.
//
//	Output Format
//
//	Вашата програма трябва да изведе толкова реда, колкото е броят на заявките.На всеки от тези редове програмата трябва да изведе по едно цяло число, равно на броя на търсените елементи от дадената редица, съответно на последователността на заявките във входа.
//
//	Sample Input 0
//
//	6
//	9 1 3 10 3 4
//	3
//	1 4
//	9 12
//	15 20
//	Sample Output 0
//
//	4
//	2
//	0