#include <iostream>
#include <vector>
#include <string>
using namespace std;

int main()
{
	long long a, b; cin >> a >> b;

	long long cMax = a + b - 1;
	long long cMin = abs(a - b);

	cout << cMax - cMin << endl;
}

//Дадени са две цели положителни числа a и b.Колко различни неотрицателни целочислени стойности можем да дадем на променливата c, така че отсечките с дължини a, b и c да могат да образуват триъгълник.Напишете програма triangle, която въвежда стойностите на a и b, и извежда търсения брой.
//
//Забележка: Tри отсечки могат да образуват триъгълник, ако дължината на всяка от тях е по - малка от сумата на дължините на другите две отсечки.
//
//Input Format
//
//Програмата прочита от стандартния вход стойностите на a и b.
//
//Constraints
//
//	: 0 < a < 10 ^ 15, 0 < b < 10 ^ 15
//
//	Output Format
//
//	Програмата трябва да изведе на стандартния изход едно цяло число, равно на търсения брой.
//
//	Sample Input 0
//
//	3 6
//	Sample Output 0
//
//	5