#include <iostream>
#include <vector>
#include <locale>
using namespace std;

int main()
{
    setlocale(LC_ALL, "en_US.UTF-8");

    int n, u, v;
    cin >> n >> u >> v;
    vector<int> nums;
    vector<int> length;

    long long output = 0;

    int temp;
    for (int i = 0; i < n; i++)
    {
        cin >> temp;
        nums.push_back(temp);
        length.push_back(0);
    }

    bool changed = false;

    do
    {
        changed = false;
        for (int i = 1; i < nums.size() - 1; i++)
        {
            if (nums[i] <= nums[i - 1] && nums[i] <= nums[i + 1])
            {
                if (nums[i - 1] <= nums[i + 1])
                {
                    length[i - 1] += length[i] + 1;
                    length[i] = 0;
                }
                else if (nums[i - 1] > nums[i + 1])
                {
                    length[i + 1] += length[i] + 1;
                    length[i] = 0;
                }
                nums.erase(nums.begin() + i);
                length.erase(length.begin() + i);
                changed = true;
            }
        }

    } while (changed);

    for (int i = 0; i < nums.size() - 1; i++)
    {

        if (nums[i] <= nums[i + 1])
        {
            output += (u * (length[i] + 1)) * v * nums[i];
        }
        else if (nums[i] > nums[i + 1])
        {
            output += (u * (length[i + 1] + 1)) * v * nums[i + 1];
        }
        else if (i + 1 == nums.size() - 1)
        {
            output += (u + length[i + 1]) * v * nums[i + 1];
        }
    }

    cout << output << endl;
}


//В улей с правоъгълно сечение са поставени перпендикулярно n на брой преградни стени, разположени на равни разстояния една от друга, които го преграждат плътно и не позволяват на водата да преминава през тях.Стените не са с еднаква височина, но височината на нито една от тях не надвишава височината на улея.Ширината на стените съвпада с ширината на улея.Освен това стените имат пренебрежимо малка дебелина.По този начин се получават n − 1 вани с форма на правоъгълен паралелепипед, с по една обща стена.
//
//Напишете програма dry, която изчислява, колко кубически метра вода може да се вмести в така образуваните вани.
//
//Input Format
//
//От първия ред на стандартния вход се въвеждат три естествени числа, разделени с по един интервал :
//
//n – брой преградни стени;
//
//u – разстоянието между преградните стени, зададено в метри;
//
//v – ширина на улея, зададена в метри.
//
//Следват n на брой цели положителни числа − височините от ляво надясно на всяка от n - те преградни стени, зададени в метри.
//
//Constraints
//
//2 ≤ n ≤ 100
//
//1 ≤ u ≤ 5
//
//1 ≤ v ≤ 5
//
//Височината на преградните стени варира от 1 метър до 12 метра.
//
//Output Format
//
//На единствения ред на стандартния изход програмата трябва да изведе едно единствено цяло число − обемът на водата, която може да се вмести между преградните стени, изчислена в кубични метри.
//
//Sample Input 0
//
//5 1 1
//2 4 8 5 7
//Sample Output 0
//
//20